# Homebrew Brewfile - delaxstudio dev environment
# Usage: brew bundle install --file=Brewfile

# Taps (none currently)

# Core development tools
brew "gh"           # GitHub CLI
brew "mise"         # Runtime version manager (node, python, etc.)
brew "starship"     # Shell prompt
brew "chezmoi"      # Dotfiles manager
brew "uv"           # Fast Python package manager

# Build tools
brew "autoconf"
brew "automake"
brew "bison"
brew "libtool"
brew "m4"
brew "meson"
brew "ninja"
brew "pkgconf"

# Media processing
brew "ffmpeg"       # Video/audio processing
brew "tesseract"    # OCR

# Applications (Casks)
cask "visual-studio-code"
cask "obsidian"
cask "arc"
cask "dropbox"
cask "box-drive"
cask "logi-options+"
cask "macfuse"
